#+TITLE: Contrasts and @formula in StatsModels.jl


* Contrast coding
  :PROPERTIES:
  :header-args: :async yes :kernel julia-1.3 :session jl-contrasts :display text/plain text/html
  :END:

** What and why?

To fit any kind of statistical model you need some kind of /numerical
representation/ of your data.  Data often comes in a /table/, a named collection
of variables of different types of data.  Some of that data is "continuous", or
basically numeric.  But often our data is not numeric (or continuous), but
"categorical", having a finite number of distinct levels.

For instance, let's look at the KB07 dataset:

#+begin_src jupyter-julia
  using DataFrames, DataFramesMeta
  using MixedModels, GLM

  kb07 = MixedModels.dataset(:kb07)

#+end_src

#+RESULTS:
:RESULTS:
: â”Œ Info: Precompiling MixedModels [ff71e718-51f3-5ec2-a782-8ffcbfa3c316]
: â”” @ Base loading.jl:1273
#+begin_example
  1789Ã—7 DataFrame
  â”‚ Row  â”‚ subj   â”‚ item   â”‚ spkr   â”‚ prec     â”‚ load   â”‚ rt_trunc â”‚ rt_raw â”‚
  â”‚      â”‚ [90mString[39m â”‚ [90mString[39m â”‚ [90mString[39m â”‚ [90mString[39m   â”‚ [90mString[39m â”‚ [90mInt16[39m    â”‚ [90mInt16[39m  â”‚
  â”œâ”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¤
  â”‚ 1    â”‚ S030   â”‚ I01    â”‚ new    â”‚ break    â”‚ yes    â”‚ 2267     â”‚ 2267   â”‚
  â”‚ 2    â”‚ S030   â”‚ I02    â”‚ old    â”‚ maintain â”‚ no     â”‚ 3856     â”‚ 3856   â”‚
  â”‚ 3    â”‚ S030   â”‚ I03    â”‚ old    â”‚ break    â”‚ no     â”‚ 1567     â”‚ 1567   â”‚
  â”‚ 4    â”‚ S030   â”‚ I04    â”‚ new    â”‚ maintain â”‚ no     â”‚ 1732     â”‚ 1732   â”‚
  â”‚ 5    â”‚ S030   â”‚ I05    â”‚ new    â”‚ break    â”‚ no     â”‚ 2660     â”‚ 2660   â”‚
  â”‚ 6    â”‚ S030   â”‚ I06    â”‚ old    â”‚ maintain â”‚ yes    â”‚ 2763     â”‚ 2763   â”‚
  â”‚ 7    â”‚ S030   â”‚ I07    â”‚ old    â”‚ break    â”‚ yes    â”‚ 3528     â”‚ 3528   â”‚
  â”‚ 8    â”‚ S030   â”‚ I08    â”‚ new    â”‚ maintain â”‚ yes    â”‚ 1741     â”‚ 1741   â”‚
  â”‚ 9    â”‚ S030   â”‚ I09    â”‚ new    â”‚ break    â”‚ yes    â”‚ 3692     â”‚ 3692   â”‚
  â”‚ 10   â”‚ S030   â”‚ I10    â”‚ old    â”‚ maintain â”‚ no     â”‚ 1949     â”‚ 1949   â”‚
  â‹®
  â”‚ 1779 â”‚ S103   â”‚ I22    â”‚ new    â”‚ break    â”‚ no     â”‚ 1623     â”‚ 1623   â”‚
  â”‚ 1780 â”‚ S103   â”‚ I23    â”‚ old    â”‚ maintain â”‚ yes    â”‚ 2706     â”‚ 2706   â”‚
  â”‚ 1781 â”‚ S103   â”‚ I24    â”‚ old    â”‚ break    â”‚ yes    â”‚ 4281     â”‚ 4281   â”‚
  â”‚ 1782 â”‚ S103   â”‚ I25    â”‚ new    â”‚ maintain â”‚ yes    â”‚ 2075     â”‚ 2075   â”‚
  â”‚ 1783 â”‚ S103   â”‚ I26    â”‚ new    â”‚ break    â”‚ yes    â”‚ 3179     â”‚ 3179   â”‚
  â”‚ 1784 â”‚ S103   â”‚ I27    â”‚ old    â”‚ maintain â”‚ no     â”‚ 1216     â”‚ 1216   â”‚
  â”‚ 1785 â”‚ S103   â”‚ I28    â”‚ old    â”‚ break    â”‚ no     â”‚ 2286     â”‚ 2286   â”‚
  â”‚ 1786 â”‚ S103   â”‚ I29    â”‚ new    â”‚ maintain â”‚ no     â”‚ 1202     â”‚ 1202   â”‚
  â”‚ 1787 â”‚ S103   â”‚ I30    â”‚ new    â”‚ break    â”‚ no     â”‚ 1581     â”‚ 1581   â”‚
  â”‚ 1788 â”‚ S103   â”‚ I31    â”‚ old    â”‚ maintain â”‚ yes    â”‚ 1601     â”‚ 1601   â”‚
  â”‚ 1789 â”‚ S103   â”‚ I32    â”‚ old    â”‚ break    â”‚ yes    â”‚ 1941     â”‚ 1941   â”‚
#+end_example
:END:

Here ~:spkr~, ~:prec~, and ~:load~ are categortical variables, each of which
takes on two different values.  If we fit a regression using this dataset, we
end up with predictors that refer to specific levels:

#+begin_src jupyter-julia
  f = @formula(rt_trunc ~ 1 + spkr + prec + spkr&prec + (1 | subj))
  mod = fit(MixedModel, f, kb07)
#+end_src

#+RESULTS:
#+begin_example
  Linear mixed model fit by maximum likelihood
   rt_trunc ~ 1 + spkr + prec + spkr & prec + (1 | subj)
       logLik        -2 logLik          AIC             BIC       
   -1.45767208Ã—10â´  2.91534417Ã—10â´  2.91654417Ã—10â´  2.91983781Ã—10â´

  Variance components:
              Column    Variance  Std.Dev. 
  subj     (Intercept)   95885.39 309.65366
  Residual              662657.47 814.03776
   Number of obs: 1789; levels of grouping factors: 56

    Fixed-effects parameters:
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
                               Estimate  Std.Error  z value  P(>|z|)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  (Intercept)                 2425.32      56.5224    42.91   <1e-99
  spkr: old                    179.992     54.4214     3.31   0.0009
  prec: maintain              -623.347     54.4214   -11.45   <1e-29
  spkr: old & prec: maintain   -86.7763    76.9856    -1.13   0.2597
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
#+end_example

Let's look at a few rows of the fixed effects design matrix that's generated for
this model:

#+begin_src jupyter-julia
  Int.(mod.X)[1:5, :]
#+end_src

#+RESULTS:
: 5Ã—4 Array{Int64,2}:
:  1  0  0  0
:  1  1  1  1
:  1  1  0  0
:  1  0  1  0
:  1  0  0  0

A few things to note: all the values are 0 or 1, and there's one column of all
1s at the start (that's the ~(Intercept)~ term).  Columns 2 and 3 correspond to
~spkr~ and ~prec~: there's a 0 where ~spkr == "new"~ and a 1 for ~"old"~.
Note that the coefficient name for this column is ~spkr: old~, which indicates
that this predictor indicates the presence of "old", relative to the (implicit)
baseline of "new".  Similarly for ~prec: maintain~.

The last column is the interaction term ~spkr&prec~, and it's the elementwise
product of the columns for ~spkr: new~ and ~pred: maintain~.

#+begin_src jupyter-julia
  kb07[1:5, :]
#+end_src

#+RESULTS:
: 5Ã—7 DataFrame
: â”‚ Row â”‚ subj   â”‚ item   â”‚ spkr   â”‚ prec     â”‚ load   â”‚ rt_trunc â”‚ rt_raw â”‚
: â”‚     â”‚ [90mString[39m â”‚ [90mString[39m â”‚ [90mString[39m â”‚ [90mString[39m   â”‚ [90mString[39m â”‚ [90mInt16[39m    â”‚ [90mInt16[39m  â”‚
: â”œâ”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”¤
: â”‚ 1   â”‚ S030   â”‚ I01    â”‚ new    â”‚ break    â”‚ yes    â”‚ 2267     â”‚ 2267   â”‚
: â”‚ 2   â”‚ S030   â”‚ I02    â”‚ old    â”‚ maintain â”‚ no     â”‚ 3856     â”‚ 3856   â”‚
: â”‚ 3   â”‚ S030   â”‚ I03    â”‚ old    â”‚ break    â”‚ no     â”‚ 1567     â”‚ 1567   â”‚
: â”‚ 4   â”‚ S030   â”‚ I04    â”‚ new    â”‚ maintain â”‚ no     â”‚ 1732     â”‚ 1732   â”‚
: â”‚ 5   â”‚ S030   â”‚ I05    â”‚ new    â”‚ break    â”‚ no     â”‚ 2660     â”‚ 2660   â”‚

** How to take control

You can set your own contrasts via the ~contrasts=~ keyword argument in ~fit~,
with the variable you want to code as the key and contrasts as the value:

#+begin_src jupyter-julia
  using StatsModels

  contrasts = Dict(
      :spkr => EffectsCoding(base = "old"),
      :prec => DummyCoding(levels = ["maintain", "break"])
  )

  mod2 = fit(MixedModel, f, kb07, contrasts=contrasts)
#+end_src

#+RESULTS:
#+begin_example
  Linear mixed model fit by maximum likelihood
   rt_trunc ~ 1 + spkr + prec + spkr & prec + (1 | subj)
       logLik        -2 logLik          AIC             BIC       
   -1.45767208Ã—10â´  2.91534417Ã—10â´  2.91654417Ã—10â´  2.91983781Ã—10â´

  Variance components:
              Column    Variance  Std.Dev. 
  subj     (Intercept)   95885.39 309.65366
  Residual              662657.47 814.03776
   Number of obs: 1789; levels of grouping factors: 56

    Fixed-effects parameters:
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
                            Estimate  Std.Error  z value  P(>|z|)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  (Intercept)              1848.58      49.5329    37.32   <1e-99
  spkr: new                 -46.6081    27.2263    -1.71   0.0869
  prec: break               666.735     38.4928    17.32   <1e-66
  spkr: new & prec: break   -43.3882    38.4928    -1.13   0.2597
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
#+end_example

This example illustrates two ways to control the ordering of levels used to
compute the contrasts: 

1. you can use ~base=~ to determine the baseline level
2. you can use ~levels=~ to indicate all the levels that are used in the
   contrasts, the first of which is automatically set as the baseline.

** Built in contrast coding schemes

StatsModels.jl provides a few commonly used contrast coding schemes, some
less-commonly used schemes, and structs that allow you to manually specify your
own, custom schemes.

All are subtypes of the ~AbstractContrasts~ type:

#+begin_src jupyter-julia
subtypes(AbstractContrasts)
#+end_src

#+RESULTS:
: 7-element Array{Any,1}:
:  ContrastsCoding            
:  DummyCoding                
:  EffectsCoding              
:  HelmertCoding              
:  HypothesisCoding           
:  SeqDiffCoding              
:  StatsModels.FullDummyCoding

And all have fairly extensive documentation via the normal help system.  For
instance:

#+begin_src jupyter-julia
?SeqDiffCoding
#+end_src

#+RESULTS:
:RESULTS:
: search: [0m[1mS[22m[0m[1me[22m[0m[1mq[22m[0m[1mD[22m[0m[1mi[22m[0m[1mf[22m[0m[1mf[22m[0m[1mC[22m[0m[1mo[22m[0m[1md[22m[0m[1mi[22m[0m[1mn[22m[0m[1mg[22m
#+begin_example
  [36m  SeqDiffCoding([base[, levels]])[39m

    Code each level in order to test "sequential difference" hypotheses, which
    compares each level to the level below it (starting with the second level).
    Specifically, the [35mn[39mth predictor tests the hypothesis that the difference
    between levels [35mn[39m and [35mn+1[39m is zero.

  [1m  Examples[22m
  [1m  â‰¡â‰¡â‰¡â‰¡â‰¡â‰¡â‰¡â‰¡â‰¡â‰¡[22m

  [36m  julia> seqdiff = StatsModels.ContrastsMatrix(SeqDiffCoding(), ["a", "b", "c", "d"]).matrix[39m
  [36m  4Ã—3 Array{Float64,2}:[39m
  [36m   -0.75  -0.5  -0.25[39m
  [36m    0.25  -0.5  -0.25[39m
  [36m    0.25   0.5  -0.25[39m
  [36m    0.25   0.5   0.75[39m

    The interpretation of sequential difference coding may be hard to see from
    the contrasts matrix itself. The corresponding hypothesis matrix shows a
    clearer picture. From the rows of the hypothesis matrix, we can see that
    these contrasts test the difference between the first and second levels, the
    second and third, and the third and fourth, respectively:

  [36m  julia> round.(pinv(seqdiff), digits=2)[39m
  [36m  3Ã—4 Array{Float64,2}:[39m
  [36m   -1.0   1.0  -0.0   0.0[39m
  [36m   -0.0  -1.0   1.0  -0.0[39m
  [36m    0.0  -0.0  -1.0   1.0[39m
#+end_example
:END:

*** Standard contrasts

The most commonly used contrasts are ~DummyCoding~ and ~EffectsCoding~ (which
are similar to ~contr.treatment~ and ~contr.sum~ in R, respectively).

*** "Exotic" contrasts

We also provide ~HelmertCoding~ and ~SeqDiffCoding~ (corresponding to base R's
~contr.helmert~ and MASS's ~contr.sdiff~).
    
*** Manual contrasts

There are two ways to manually specify contrasts.  First, you can specify them
*directly* via ~ContrastsCoding~.  If you do, it's good practice to specify the
levels corresponding to the rows of the matrix, although they can be omitted in
which case they'll be inferred from the data.

For instance, here's a weird set of contrasts for ~:spkr~:

#+begin_src jupyter-julia
cs = Matrix([-1/3 2/3]')
contr_manual = Dict(:spkr => StatsModels.ContrastsCoding(cs, levels=["old", "new"]))
mod3 = fit(MixedModel, f, kb07, contrasts=contr_manual)
#+end_src

#+RESULTS:
:RESULTS:
: â”Œ Warning: `ContrastsCoding(contrasts)` is deprecated and will not be exported in the future, use `HypothesisCoding(pinv(contrasts))` instead.
: â”‚   caller = #ContrastsCoding#8 at contrasts.jl:526 [inlined]
: â”” @ Core /home/dave/.julia/packages/StatsModels/NakzS/src/contrasts.jl:526
#+begin_example
  Linear mixed model fit by maximum likelihood
   rt_trunc ~ 1 + spkr + prec + spkr & prec + (1 | subj)
       logLik        -2 logLik          AIC             BIC       
   -1.45767208Ã—10â´  2.91534417Ã—10â´  2.91654417Ã—10â´  2.91983781Ã—10â´

  Variance components:
              Column    Variance  Std.Dev. 
  subj     (Intercept)   95885.39 309.65366
  Residual              662657.47 814.03776
   Number of obs: 1789; levels of grouping factors: 56

    Fixed-effects parameters:
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
                               Estimate  Std.Error  z value  P(>|z|)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  (Intercept)                 2545.31      50.3425    50.56   <1e-99
  spkr: new                   -179.992     54.4214    -3.31   0.0009
  prec: maintain              -681.198     40.582    -16.79   <1e-62
  spkr: new & prec: maintain    86.7763    76.9856     1.13   0.2597
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
#+end_example
:END:

(Note that the estimates and even the signs of the fixed effect Î²s change when
we change the contrasts, but the overall log-likelihood doesn't).

We can see that the values from the contrasts matrix we specified are plugged
directly in to the fixed effects matrix, and are also used in computing the
predictor for the interaction:

#+begin_src jupyter-julia
mod3.X[1:5, :]
#+end_src

#+RESULTS:
: 5Ã—4 Array{Float64,2}:
:  1.0   0.666667  0.0   0.0     
:  1.0  -0.333333  1.0  -0.333333
:  1.0  -0.333333  0.0  -0.0     
:  1.0   0.666667  1.0   0.666667
:  1.0   0.666667  0.0   0.0     

*** Contrasts from hypotheses

A better way to specify manual contrasts is via ~HypothesisCoding~, where each
row of the matrix corresponds to the weights given to the cell means of the
levels corresponding to each column (see [[https://doi.org/10.1016/j.jml.2019.104038][Schad et al. 2020]] for more
information).  This is less interesting with only two levels, so let's look at a
scenario where we combine ~:spkr~ and ~:prec~ into a single, 4-level predictor,
and want to test some strange hypotheses.

#+begin_src jupyter-julia
  kb07ex = @transform(kb07, spkr_prec = :spkr .* "-" .* :prec);

  f2 = @formula(rt_trunc ~ 1 + spkr_prec + (1 | subj))
  mod4 = fit(MixedModel, f2, kb07ex)
#+end_src

#+RESULTS:
#+begin_example
  Linear mixed model fit by maximum likelihood
   rt_trunc ~ 1 + spkr_prec + (1 | subj)
       logLik        -2 logLik          AIC             BIC       
   -1.45767208Ã—10â´  2.91534417Ã—10â´  2.91654417Ã—10â´  2.91983781Ã—10â´

  Variance components:
              Column    Variance  Std.Dev. 
  subj     (Intercept)   95885.39 309.65366
  Residual              662657.47 814.03776
   Number of obs: 1789; levels of grouping factors: 56

    Fixed-effects parameters:
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
                           Estimate  Std.Error  z value  P(>|z|)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  (Intercept)              2425.32     56.5224    42.91   <1e-99
  spkr_prec: new-maintain  -623.347    54.4214   -11.45   <1e-29
  spkr_prec: old-break      179.992    54.4214     3.31   0.0009
  spkr_prec: old-maintain  -530.131    54.4839    -9.73   <1e-21
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
#+end_example

Let's say we want to test whether the effect of ~:prec~ depends on whether
~:spkr~ is old vs. new.  We need one contrast to test the hypothesis that
~"maintain" != "break"~ for "new", and another for "old".  That leaves one over,
to test the overall difference between "new" and "old".

#+begin_src jupyter-julia
  levels = ["new-break", "new-maintain", "old-break", "old-maintain"]

  prec_old = (levels .== "old-break") .- (levels .== "old-maintain")
  prec_new = (levels .== "new-break") .- (levels .== "new-maintain")
  old_new = (abs.(prec_old) .- abs.(prec_new)) ./ 2

  hypotheses = Matrix(hcat(old_new, prec_old, prec_new)')
#+end_src

#+RESULTS:
: 3Ã—4 Array{Float64,2}:
:  -0.5  -0.5  0.5   0.5
:   0.0   0.0  1.0  -1.0
:   1.0  -1.0  0.0   0.0

#+begin_src jupyter-julia
  contr_hyp = Dict(:spkr_prec => HypothesisCoding(hypotheses,
                                                  labels=["old", "(old) break", "(old) maint"]))
  mod5 = fit(MixedModel, f2, kb07ex, contrasts = contr_hyp)
#+end_src

#+RESULTS:
#+begin_example
  Linear mixed model fit by maximum likelihood
   rt_trunc ~ 1 + spkr_prec + (1 | subj)
       logLik        -2 logLik          AIC             BIC       
   -1.45767208Ã—10â´  2.91534417Ã—10â´  2.91654417Ã—10â´  2.91983781Ã—10â´

  Variance components:
              Column    Variance  Std.Dev. 
  subj     (Intercept)   95885.39 309.65366
  Residual              662657.47 814.03776
   Number of obs: 1789; levels of grouping factors: 56

    Fixed-effects parameters:
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
                          Estimate  Std.Error  z value  P(>|z|)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  (Intercept)             2181.94     45.6362    47.81   <1e-99
  spkr_prec: old           136.604    38.4928     3.55   0.0004
  spkr_prec: (old) break   710.123    54.4527    13.04   <1e-38
  spkr_prec: (old) maint   623.347    54.4214    11.45   <1e-29
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
#+end_example
